Revit 2026 API

# ElectricalSystemPanelName Property

---

The Panel name of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string PanelName { get; }
```
```vb
Public ReadOnly Property PanelName As String
	Get
```
```cpp
public:
property String^ PanelName {
	String^ get ();
}
```
```fsharp
member PanelName : string with get
```

#### Property Value

String

This property is used to retrieve the Panel name of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace